[{"date":"7/19/2021","summary":"Very excited to announce the launch of our <a href='https://www.facebook.com/tremendoustutors' target='_blank'>Facebook page</a>!!"},{"date":"7/8/2021","summary":"Shoutout to TT Co-Founders Alex Goldberg and Priyanka Deka and NHS Officers Tiffany Zheng and Andrew Chen for making this partnership happen! So excited!"},{"date":"7/8/2021","summary":"Thrilled to announce that beginning next year, Tremendous Tutors will be partnering with Westborough’s <a href='https://www.nhs.us' target='_blank'>National Honor Society</a> to bring together more students and tutors!"},{"date":"6/18/2021","summary":"Happy Summer! Take a little break from studying :)"},{"date":"5/30/2021","summary":"Nervous for finals? We can help! Click the Google Form link!!"},{"date":"5/16/2021","summary":"Remember, we offer one-time study sessions if you need help studying for finals!"},{"date":"4/9/2021","summary":"Make sure to tell your friends about Tremendous Tutors! We take all struggling middle and high school students!!"},{"date":"3/8/2021","summary":"You can now find us on Instagram! Follow @tremendoustutors for more updates!"},{"date":"2/14/2021","summary":"Happy Valentine’s Day! A great gift would be letting your significant other know about Tremendous Tutors :)"},{"date":"2/5/2021","summary":"Tremendous Tutors just had its tenth tutoring session! Sign up for your own using the link on this page!"},{"date":"1/9/2021","summary":"Sign up using the Google Form link on this page if you’re interested in free tutoring!"},{"date":"1/9/2021","summary":"We now have four students!"},{"date":"1/5/2021","summary":"Tremendous Tutors now has its second student!"},{"date":"1/4//2021","summary":"Our first tutoring session was held today!"},{"date":"1/2/2021","summary":"Tremendous Tutors has our first student!"},{"date":"1/1/2021","summary":"Tutoring sign-ups are now open to students!"},{"date":"12/14/2020","summary":"Huge shoutout to our Web Designer Kevin Xu for making this awesome website!!"},{"date":"12/14/2020","summary":"Welcome to Tremendous Tutors! Sign-ups will be open beginning January 1st!"}]