[{"name":"Viola Li","grade":"12","desc":"Hi, my name is Viola and I am very excited to be a part of Tremendous Tutors! As a current rising senior at Westborough High School, I have taught educational summer classes and privately tutored students throughout the school year. Ultimately, I love interacting and working with children/teens, which is why I have consistently volunteered as a local camp counselor, tutor, and babysitter for years in the past and hopefully more to come. Aside from tutoring, my other passions include dancing, hiking, and more recently, surfing. In addition, I am an active member of Model UN and the captain of Mock Trial, where real life delegate assemblies and trials are simulated.","subj":"French, English","imgFileName":"violalbio.png"},{"name":"Tiffany Zheng","grade":"12","desc":"Hi everyone! My name is Tiffany Zheng, and I am a rising senior at Westborough High School and the Publicity Coordinator of Tremendous Tutors. I am most passionate about biology and english, and I would love to help younger students within these subjects. I have been tutored when I was younger, so I understand the process of explaining topics in different ways and to always remain patient. I also have experience of tutoring and working with others through helping my younger cousins with their homework. For a little bit of background on me, I am the President of Ranger’s for a Cure and the Secretary of Student Council, I love all kinds of music, and I’m obsessed with indoor plants!","subj":"English, Biology","imgFileName":"tiffanyzbio.png"},{"name":"Priyanka Deka","grade":"12","desc":"Hi! My name is Priyanka and I am a Co-Founder and Co-President of Tremendous Tutors. I am a senior at Westborough High School and my favorite classes have been biology, calculus, and psychology. Outside of school, I love writing, taekwondo, listening to music, and of course, working as a tutor.","subj":"English, Math, Biology, Chemistry","imgFileName":"priyankadbio.png"},{"name":"Kevin Xu","grade":"12","desc":"Tremendous Tutors Web Designer Kevin Xu is also a member of Student Council, National Honor Society, and Westborough High School's track and field team. His favorite event is the pole vault in which he placed 5th at states. In his free time, he enjoys website design and coding in general! He is very passionate about anything STEM and loves tutoring students!","subj":"Physics, Math, Chemistry, Computer Science","imgFileName":"kevinxbio.jpeg"},{"name":"Shruthi Nelluri","grade":"12","desc":"Hey everyone! My name is Shruthi and I'm a senior at Westborough High School. My favorite subjects at school are computer science and math. I love to code websites, games, and apps, and I really enjoy competing at hackathons with my friends. Outside of school, I'm a teacher at Code Ninjas and I love to play tennis. I play for the varsity team at my high school and I wish to someday play in college. Some of my hobbies include cooking and eating, mostly eating, and doing yoga!","subj":"Computer Science, Spanish, Physics, Math","imgFileName":"shruthinbio.png"},{"name":"Alex Goldberg","grade":"12","desc":"Alex Goldberg, Co-Founder and Co-President of Tremendous Tutors, is a senior at Westborough High School and loves to learn new things and help other students! In his free time, he is a member of the high school ski team, works as a teacher's assistant at his synagogue, and is Student Council's President. He also participates in a few other clubs, including National Honor Society and the VISION Global Health Club, in which he serves as treasurer.","subj":"History, Spanish, Biology, English, Math","imgFileName":"alexgbio.png"}]